Revit 2026 API

# OpeningIsTransparentIn3D Property

---

Indicates if the opening is transparent in 3D view when loaded into the project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsTransparentIn3D { get; set; }
```
```vb
Public Property IsTransparentIn3D As Boolean
	Get
	Set
```
```cpp
public:
property bool IsTransparentIn3D {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsTransparentIn3D : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when access this property in an opening belonging to a Revit project document. |

This property is only valid in Revit family documents.

#### Reference

Opening Class

Autodesk.Revit.DB Namespace